{"weightsManifest": [{"weights": [{"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 1, 32]}, {"name": "conv2d_1/bias", "dtype": "float32", "shape": [32]}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 32, 32]}, {"name": "conv2d_2/bias", "dtype": "float32", "shape": [32]}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [800, 128]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [128]}], "paths": ["group3-shard1of1"]}, {"weights": [{"name": "dense_2/kernel", "dtype": "float32", "shape": [128, 10]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [10]}], "paths": ["group4-shard1of1"]}], "modelTopology": {"keras_version": "2.1.6", "model_config": {"config": [{"config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true, "batch_input_shape": [null, 28, 28, 1], "kernel_constraint": null, "name": "conv2d_1", "dtype": "float32", "trainable": true, "padding": "valid", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "relu", "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_2", "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "units": 128, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "units": 10, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}, "backend": "tensorflow", "training_config": {"loss": "categorical_crossentropy", "sample_weight_mode": null, "optimizer_config": {"config": {"amsgrad": false, "beta_1": 0.8999999761581421, "epsilon": 1e-07, "decay": 0.0, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033}, "class_name": "Adam"}, "metrics": ["accuracy"], "loss_weights": null}}}